public/wishlist.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="index.html">Giovanni's Diary</a> &gt;
</p>

<div id="outline-container-org9e02b31" class="outline-2">
<h2 id="org9e02b31">Wish list&#xa0;&#xa0;&#xa0;<span class="tag"><span class="global">global</span></span></h2>
<div class="outline-text-2" id="text-org9e02b31">
<p>
This document contains my wishlist for future projects that do not
belong to any of the other wishlists. Generally, each section of
this wiki has It's own wishlist which you can access from the
home pages.
</p>

<p>
I use <b>org-agenda</b> to manage all the <b>TODO</b> items in the different
wishlist files. Just for completeness, here is a list of the other
wishlist files:
</p>

<ul class="org-ul">
<li><a href="reading/wishlist.html">reading wishlist</a></li>
<li><a href="programming/wishlist.html">programming wishlist</a></li>
<li><a href="programming/emacs/wishlist.html">emacs wishlist</a></li>
</ul>
</div>

<div id="outline-container-org8fe41db" class="outline-3">
<h3 id="org8fe41db"><span class="todo TODO">TODO</span> Add more style</h3>
<div class="outline-text-3" id="text-org8fe41db">
<p>
This website is quite minimal and I really like this, yet I think I
can work more on the presentation and the style of navigation. I want
to experiment with some ASCII art in the future.
</p>
</div>
</div>

<div id="outline-container-org4868573" class="outline-3">
<h3 id="org4868573"><span class="todo TODO">TODO</span> Improve the About Me page</h3>
<div class="outline-text-3" id="text-org4868573">
<p>
Add a sort of autobiografy to the page. From there, you could expand
It with additional information about my past in other pages. This
would make me reflect about my past and document It so that I won't
forget.
</p>

<hr />

<p>
Travel: <a href="index.html">Giovanni's Diary</a>, <a href="theindex.html">Index</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
